package Tencent.LeeCode.Binary_DP_410;

class Solution {
    public int splitArray(int[] nums, int k) {

        // 边界情况
        if (nums.length == 1) { return nums[nums.length - 1]; }
        
        // 确定二分查找上下界
        long left = 0, right = 0;
        for (int num : nums) {
            left = Math.max(left, num); // 下界：数组元素最大值
            right += num; // 上界：元素和
        }

        // 二分查找
        while (left < right) {
            // 猜测最优解
            long mid = left + (right - left) / 2;
            
            // 验证猜测的最优解（如果使用mid作为最大和，需要分割多少个数组）
            int count = 1; // 至少分割为一个数组
            long currSum = 0; // 当前分割数组的和
            for (int num : nums) {
                // 为什么这里可以先加入后判断？不会导致多加入一个导致超出mid的num吗？
                // 1. 这里只是用来判断加入该元素是否会导致超限（是否需要开新的数组）
                //    如果超限就增加数组个数并将导致超限的元素作为新数组的首个元素
                //    所以可以这么写
                // 明明是很简单很好理解的逻辑却要想半天，nnc真是🐷啊...
                currSum += num;
                if (currSum > mid) {
                    count++;
                    currSum = num; // 开一个新数组并作为第一个元素加入
                }
            }

            if (count <= k) {
                // 分割后的数组数量小于等于准备分割成的个数，说明mid的值可能偏大了，尝试更小的值（右边界缩小）
                right = mid;
            } else {
                // 分割后的数组数量大于准备分割成的个数，说明mid偏小了，需要猜测更大的值（左边界增大）
                left = mid + 1;
            }

        }
        
        return (int) left; // 最终 left == right，得出结果，转换为int类型返回
        
    }
}